file_path = 'result.txt'


def create_file_use_user_data(path):
    """
    Запитує в користувача введення речень та записує їх у файл.

    Ця функція створює (або перезаписує, якщо він вже існує) текстовий файл
    за зазначеним шляхом.
    Користувач вводить речення, яке записується у файл. Кожне речення
    записується з нового рядка.
    Введення триває до тих пір, поки користувач не надішле пустий рядок,
    що сигналізує про завершення.

    Параметри:
        path (str): Шлях до файлу, у який буде вестися запис.

    Повертає:
        None
    """

    with open(path, 'w') as file:
        while True:
            user_sentence = input(
                'Уведіть речення (для завершення використовуєте пустий рядок): '
            )

            if user_sentence == '':
                break
            else:
                file.write(user_sentence + '\n')


create_file_use_user_data(file_path)
