'''
	Згенеруйте  список цілих чисел int_elements довжино 25 елементів. Числа мають бути випадкові в диапазоні  1 - 500.
	Виведіть на єкран список int_elements.
	Ваше завдання – вивести наступні списки по одному в рядку:
	Список, що складається із квадратів int_elements.
	Список, що складається із остач ділення на 11 елементів int_elements.
	Список, що складається лише з парних елементів int_elements.
	Список, що складається лише з елементів int_elements з непарною кількістю цифр.
	Список, що складається з елементів int_elements, що стоять на позиціях які  не є кратними 3.
	Вихідні дані
	У кожному із шести рядків виведіть відповідний список у стандартному форматі python'а.
'''


import random 

line_range = 25

int_elements = [random.randint(1, 500) for _ in range(line_range)]

print(int_elements)
